class GisQuery:
    Q001 = "How many hotspots are there in Kanchanapisek this year on the map?"
    Q002 = "อุณหภูมิที่สัตหีบเป็นเท่าไร โชว์บนแผนที่ให้ดูหน่อย"
    Q003 = "โชว์อุณหภูมิของสัตหีบบนแผนที่ให้ดูหน่อย"
    Q004 = "แสดงร่องรอยการเผาไหม้ในเดือนมี.ค.ของปี 2025,2024,2023 และทำการหาว่าแต่ละพื้นที่มีการเผาไหม้ซ้ำซ้อนกี่ครั้งในพิ้นที่อุทยานแม่ปิง"
    Q005 = "หาข้อมูลพิกัด 7-11 ในกรุงเทพฯมีกี่จุดและแต่ละจุดมีความห่างกันโดยเฉลี่ยเท่าไหร่"


class NonGisQuery:
    Q001 = "จากการดูแผนที่จะเห็นว่า เส้นลมจากเชียงใหม่พัดลงใต้เข้าสู่ภาคกลาง"
    Q002 = "เรามีแผนที่เส้นลมไหม"
    Q003 = "Please show me the hotspot layer in Thailand on the map"
    Q004 = "How does a bird fly?"
